Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Comment>Дата выдачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Comment>Дата изъятия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации в системе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГендернаяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееПоздравление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУточняемый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧленыСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:DocumentRef.НакладнаяНаДоставку</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИнформационныеКарты/Forms/ФормаЭлементаРегистрационнаяКарта/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьНаименование()

	Если (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхКарт.Регистрационная")) Тогда
		Возврат НСтр("ru = 'Регистрационная № '; uk = 'Реєстраційна № '") + Объект.КодКарты;
	КонецЕсли; 
	Если (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхКарт.Дисконтная")) Тогда
		Если ЗначениеЗаполнено(Объект.ВидДисконтнойКарты) И (Не ПустаяСтрока(Объект.КодКарты)) Тогда
			Возврат Шаблон("[ВидДисконтнойКарты] № [КодКарты]", 
				Новый Структура("ВидДисконтнойКарты,КодКарты", Объект.ВидДисконтнойКарты, Объект.КодКарты));
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат "№ " + Объект.КодКарты; 
		
КонецФункции // ПолучитьНаименование()

&НаСервере
Функция ПолучитьНаименованиеНаСервере()

	Если (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхКарт.Регистрационная")) Тогда
		Возврат НСтр("ru = 'Регистрационная № '; uk = 'Реєстраційна № '") + Объект.КодКарты;
	КонецЕсли; 
	Если (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхКарт.Дисконтная")) Тогда
		Если ЗначениеЗаполнено(Объект.ВидДисконтнойКарты) И (Не ПустаяСтрока(Объект.КодКарты)) Тогда
			Возврат Шаблон("[ВидДисконтнойКарты] № [КодКарты]", 
				Новый Структура("ВидДисконтнойКарты,КодКарты", Объект.ВидДисконтнойКарты, Объект.КодКарты));
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат "№ " + Объект.КодКарты; 
		
КонецФункции // ПолучитьНаименованиеНаСервере()


&НаКлиенте
Процедура ВидКартыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ВидКарты) Тогда
		Объект.ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыИнформационныхКарт.Магнитная");
	КонецЕсли; 
	
	Если (Объект.ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыИнформационныхКарт.Штриховая")) Тогда
		Элементы.ГруппаГруппаКодКартыВидКартыСтраници.ТекущаяСтраница = Элементы.ГруппаКодКартыШтриховая;
	Иначе
		Элементы.ГруппаГруппаКодКартыВидКартыСтраници.ТекущаяСтраница = Элементы.ГруппаКодКартыМагнитная;
	КонецЕсли; 
	
КонецПроцедуры // ВидКартыПриИзменении()

&НаКлиенте
Процедура ТипШтрихкодаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ТипШтрихкода) Тогда
		Объект.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	КонецЕсли; 
	
КонецПроцедуры // ТипШтрихкодаПриИзменении()

&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ШтрихкодНачалоВыбораСервер();
	
	КодКартыПриИзменении(Элемент);
	
КонецПроцедуры // ШтрихкодНачалоВыбора()

&НаСервере
Процедура ШтрихкодНачалоВыбораСервер()
	
	Объект.КодКарты = РегистрыСведений.Штрихкоды.СформироватьШтрихКод(Неопределено, Объект.ТипШтрихкода);
	
КонецПроцедуры // ШтрихкодНачалоВыбораСервер()

&НаКлиенте
Процедура КодКартыПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // КодКартыПриИзменении()

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура ВладелецКартыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ВладелецКарты) Тогда
		Объект.ВладелецКарты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.ВладелецКарты, ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	КонецЕсли;
	
	// Настройка формы.	
	ГруппаПользователейПриИзменении(Неопределено);
	
КонецПроцедуры // ВладелецКартыПриИзменении()

&НаКлиенте
Процедура ГруппаПользователейПриИзменении(Элемент)
	
	// Настройка формы.	
	Элементы.ГруппаПользователей.ОтметкаНезаполненного = ЗначениеЗаполнено(Объект.ВладелецКарты) И (Не ЗначениеЗаполнено(Объект.ГруппаПользователей));
	
КонецПроцедуры // ГруппаПользователейПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВладелецаКарты.
	ТипВладелецаКарты = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	
	// Данные.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
	// Отказ.
	Отказ = (Не Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.	
	ВидКартыПриИзменении(Неопределено);
	ВладелецКартыПриИзменении(Неопределено);

КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ТипШтрихкода) Тогда
		Объект.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	КонецЕсли; 
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименованиеНаСервере(), Элементы.Наименование);
	
КонецПроцедуры // ПриЧтенииНаСервере()
